// UI와 API의 차이점

// 공통점 : 인터페이스라는 점
// 차이점 : 유저와 프로그래머의 차이

// 사용자를 대면하는 접점 = UI

// alert는 이미 만들어져 있는 명령어이자 애플리케이션이다.
// 알고보면 되게 복잡한 애플리케이션이다.

// 우리는 명령어와 입력을 넣었을 뿐, 우리가 제작한 애플리케이션이 아니다.

// 코드의 형태를 띄고 있는 인터페이스 -> 이걸 우리가 응용해서 애플리케이션을 만들 수 있잖아.
// = 애플리케이션 프로그래밍 인터페이스

// 개발자가 아닌 사람들은 UI를 통해 시스템(웹 브라우저)을 제어하고,
// 개발자는 애플리케이션 프로그래밍 인터페이스를 이용해 맥락에 맞게 응용해서 시스템을 제어



// ***UI는 사용자에게 직접적으로 보이며, 시각적 요소와 상호작용을 통해 사용자와 소프트웨어 간의 연결을 제공
// ***API는 주로 소프트웨어 간의 상호작용을 위한 규칙과 도구를 제공하여, 프로그래밍 방식으로 서로 통신하고 데이터를 교환한다.


// 주체적인 프로그래밍

// 레퍼런스와 튜토리얼
// 프로그래밍을 공부하기 위한 자료는 크게 레퍼런스(사전)와 튜토리얼(안내서)가 있다.
// 통상 튜토리얼은 언어와 문법을 설명하고, 레퍼런스는 명령어의 사전

// 자바스크립트의 API(자바스크립트에서 제공해주는 기본적인 API들) , 자바스크립트가 동작하는 호스트 환경의 API

// **검색해서 찾아내는 능력이 문제해결 능력이다.
